#+TITLE: Robust Notes with Embedded Code
#+URL: https://www.arcadianvisions.com/blog/2018/org-nix-direnv.html
#+AUTHOR: lujun9972
#+TAGS: raw
#+DATE: [2018年 09月 20日 星期四 22:28:47 CST]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t n:nil ::t |:t ^:nil -:nil f:t *:t <:nil
Emacs's org-mode has great [[https://orgmode.org/manual/Working-with-source-code.html#Working-with-source-code][facilities for working with source code]], often referred to by the name *Org Babel*. A simple use is having source code from various languages embedded in a single text file that is otherwise occupied with talking about that code.
Emacs的组织模式有很好的[[https://orgmode.org/manual/Working-with-source-code.html# working -with-source-code][处理源代码的工具]]，通常被称为*Org Babel*。一个简单的用法是将来自不同语言的源代码嵌入到一个文本文件中，否则这个文本文件将被用来讨论这些代码。

There are myriad ways one can use this functionality, but here let's focus on just one: short code demonstrations. While working on a large project, you encounter a technique or library whose usage is not obvious to you today. This means that even as you figure out how to solve your problem today, when you come back to your code a year from now, your solution may again not be obvious to future-you who has forgotten the hard-won lessons of today-you. What we want to record in our notes is a set of example programs we wish we found when writing today's code.
有无数种方法可以使用这个功能，但是这里我们只关注一种:简短的代码演示。在处理大型项目时，您会遇到一种技术或库，其用法在今天并不明显。这意味着，即使您现在已经找到了解决问题的方法，但当您一年后重新回到您的代码时，您的解决方案可能对将来(您已经忘记了今天来之不易的教训)仍然不是很明显。我们想在笔记中记录的是一组示例程序，我们希望在编写今天的代码时能够找到它们。

Now, the tricky part in finding the perfect example for whatever problem you're facing is that the author of the perfect example must be using the /exact same/ tools that you are. It's hardly a perfect example if the author uses a different version of some software library at the center of what you're trying to do! We want the example to exactly reproduce the environment in which we are building our larger project. No surprises, please.
* Deep JSON Traversal

I have a JSON document that is a nested list of single-field objects
instead of a top-level object with multiple fields, and I want to
flatten the list. I am using
[[https://hackage.haskell.org/package/lens-4.17/docs/Control-Lens-Plated.html#v:deep][deep]]=lens= package to do this. Its type doesn't make it obvious
what it does, so here is a example of how we are using it.

#+BEGIN_SRC runhaskell :results output
{-# LANGUAGE OverloadedStrings #-}
import Control.Lens (view, deep)
import Data.Aeson
import Data.Aeson.Lens (_Object)
import Data.Text (Text)
import Data.Vector (fromList)

array :: [Value] -> Value
array = Array . fromList

main :: IO ()
main = print (view (deep _Object) x)
where x = array [ object [ "name" .= ("Bob" :: Text) ]
, array [ object ["age" .= (64 :: Int) ]
, array [] ] ]
#+END_SRC

#+RESULTS:
: fromList [("age",Number 64.0),("name",String "Bob")]
#+END_EXAMPLE

* Not Perfect
*不完美
:PROPERTIES:
属性:
:CUSTOM_ID: org0b4e715
:CUSTOM_ID org0b4e715
:END:
结束:

When doing any substantial programming, I use [[https://github.com/MaskRay/ccls/][ccls]] or [[https://github.com/cquery-project/cquery][cquery]] for C++, and [[https://github.com/commercialhaskell/intero][intero]] for Haskell. I have not worked out how to directly wire such tools in to writing notes as shown above. The main challenge is that external tooling really wants to work with files on disk, while we're trying to move beyond that here.
在做任何实质性的编程时，我使用[[https://github.com/MaskRay/ccls/][ccls]]或[[https://github.com/cquery-project/cquery][cquery]]用于c++，而[[https://github.com/commercialhaskell/intero][intero]]用于Haskell。我还没有想出如何直接把这些工具连接到写笔记如上所示。主要的挑战是，外部工具确实需要处理磁盘上的文件，而我们正在尝试超越这一点。

If you have your tooling setup to work for any files in your project directory, I recommend investigating =org-babel-tangle=. Making this work requires only that you add =:tangle my-example.hs :comments link= to your =runhaskell= source block header. Then you can use =org-babel-tangle= (=C-c C-v t=) to write your source block to the named file. That file will let you use a tool like =intero= to help you write more of your example program, and, when you're ready, you can run =org-babel-detangle= in the buffer where you edited the =my-example.hs= file to sync your changes back to the org file.
如果您已经为项目目录中的任何文件设置了工具，我建议您调查=org-babel-tangle=。使这个工作只需要您添加=:tangle my-example。hs:注释链接=到您的=runhaskell=源块头。然后可以使用=org-babel-tangle= (=C-c C-v t=)将源块写入指定文件。该文件将允许您使用=intero=之类的工具来帮助您编写更多示例程序，并且，当您准备好时，可以在编辑=my-example的缓冲区中运行=org-babel-detangle=。将您的更改同步回组织文件。

Alternately, you can manually include a separate source file into your org notes like this:
或者，你可以手动将一个独立的源文件包含到你的组织中，就像这样:

#+BEGIN_EXAMPLE
I wrote this example code with fancy tooling, but I'd like to talk
about it here and see its output.

#+INCLUDE: "test.hs" src runhaskell

#+BEGIN_SRC runhaskell :exports results :prologue (with-temp-buffer (insert-file-contents "test.hs") (buffer-string))
#+END_SRC

#+RESULTS:
: fromList [("age",Number 64.0),("name",String "Bob")]
#+END_EXAMPLE

When you export your org notes, the file's source will show up thanks to the =#+INCLUDE:= directive, and the output will show up thanks to the source block with the =:prologue= header. If you're doing this often, you will probably want to define a helper to make that =:prologue= a bit more terse, or define a snippet to generate the whole blob of boilerplate. That said, I find this option less appealing since you no longer see your source code and its output in the same file.
当您导出org注释时，文件的源代码将显示在=#+INCLUDE:=指令中，输出将显示在具有=:prologue= header的源代码块中。如果您经常这样做，您可能希望定义一个帮助器，使=:prologue=更简洁一些，或者定义一个代码片段来生成整个样板文件。也就是说，我发现这个选项不太吸引人，因为您不再在同一个文件中看到源代码及其输出。
